Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/atdf/PIC32MM0016GPL028.atdf
         <register caption="" name="CNFA" offset="0x3b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFA" />
            <bitfield caption="" mask="0x00000002" name="CNFA" />
            <bitfield caption="" mask="0x00000004" name="CNFA" />
            <bitfield caption="" mask="0x00000008" name="CNFA" />
            <bitfield caption="" mask="0x00000010" name="CNFA" />
         </register>
         <register caption="" name="CNFB" offset="0x4b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFB" />
            <bitfield caption="" mask="0x00000002" name="CNFB" />
            <bitfield caption="" mask="0x00000004" name="CNFB" />
            <bitfield caption="" mask="0x00000008" name="CNFB" />
            <bitfield caption="" mask="0x00000010" name="CNFB" />
            <bitfield caption="" mask="0x00000020" name="CNFB" />
            <bitfield caption="" mask="0x00000040" name="CNFB" />
            <bitfield caption="" mask="0x00000080" name="CNFB" />
            <bitfield caption="" mask="0x00000100" name="CNFB" />
            <bitfield caption="" mask="0x00000200" name="CNFB" />
            <bitfield caption="" mask="0x00000400" name="CNFB" />
            <bitfield caption="" mask="0x00000800" name="CNFB" />
            <bitfield caption="" mask="0x00001000" name="CNFB" />
            <bitfield caption="" mask="0x00002000" name="CNFB" />
            <bitfield caption="" mask="0x00004000" name="CNFB" />
            <bitfield caption="" mask="0x00008000" name="CNFB" />
         </register>
         <register caption="" name="CNFC" offset="0x5b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000200" name="CNFC" />
         </register>
         <register caption="" name="SR0A" offset="0x3c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="SR0A" />
            <bitfield caption="" mask="0x00000002" name="SR0A" />
            <bitfield caption="" mask="0x00000004" name="SR0A" />
            <bitfield caption="" mask="0x00000008" name="SR0A" />
            <bitfield caption="" mask="0x00000010" name="SR0A" />
         </register>
         <register caption="" name="SR0B" offset="0x4c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="SR0B" />
            <bitfield caption="" mask="0x00000002" name="SR0B" />
            <bitfield caption="" mask="0x00000004" name="SR0B" />
            <bitfield caption="" mask="0x00000008" name="SR0B" />
            <bitfield caption="" mask="0x00000010" name="SR0B" />
            <bitfield caption="" mask="0x00000020" name="SR0B" />
            <bitfield caption="" mask="0x00000040" name="SR0B" />
            <bitfield caption="" mask="0x00000080" name="SR0B" />
            <bitfield caption="" mask="0x00000100" name="SR0B" />
            <bitfield caption="" mask="0x00000200" name="SR0B" />
            <bitfield caption="" mask="0x00000400" name="SR0B" />
            <bitfield caption="" mask="0x00000800" name="SR0B" />
            <bitfield caption="" mask="0x00001000" name="SR0B" />
            <bitfield caption="" mask="0x00002000" name="SR0B" />
            <bitfield caption="" mask="0x00004000" name="SR0B" />
            <bitfield caption="" mask="0x00008000" name="SR0B" />
         </register>
         <register caption="" name="SR0C" offset="0x5c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000200" name="SR0C" />
         </register>
         <register caption="" name="SR1A" offset="0x3d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="SR1A" />
            <bitfield caption="" mask="0x00000002" name="SR1A" />
            <bitfield caption="" mask="0x00000004" name="SR1A" />
            <bitfield caption="" mask="0x00000008" name="SR1A" />
            <bitfield caption="" mask="0x00000010" name="SR1A" />
         </register>
         <register caption="" name="SR1B" offset="0x4d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="SR1B" />
            <bitfield caption="" mask="0x00000002" name="SR1B" />
            <bitfield caption="" mask="0x00000004" name="SR1B" />
            <bitfield caption="" mask="0x00000008" name="SR1B" />
            <bitfield caption="" mask="0x00000010" name="SR1B" />
            <bitfield caption="" mask="0x00000020" name="SR1B" />
            <bitfield caption="" mask="0x00000040" name="SR1B" />
            <bitfield caption="" mask="0x00000080" name="SR1B" />
            <bitfield caption="" mask="0x00000100" name="SR1B" />
            <bitfield caption="" mask="0x00000200" name="SR1B" />
            <bitfield caption="" mask="0x00000400" name="SR1B" />
            <bitfield caption="" mask="0x00000800" name="SR1B" />
            <bitfield caption="" mask="0x00001000" name="SR1B" />
            <bitfield caption="" mask="0x00002000" name="SR1B" />
            <bitfield caption="" mask="0x00004000" name="SR1B" />
            <bitfield caption="" mask="0x00008000" name="SR1B" />
         </register>
         <register caption="" name="SR1C" offset="0x5d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000200" name="SR1C" />
         </register>
      </register-group>
   </module>
   <module caption="" id="02511" name="HLVD" version="">
      <register-group name="HLVD">
         <register caption="High/Low-Voltage Detect Control Register" name="HLVDCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="High/Low-Voltage Detection Limit Select bits" mask="0x0000000F" name="HLVDL" values="HLVDCON__HLVDL" />
            <bitfield caption="High/Low-Voltage Detection Event Status bit" mask="0x00000100" name="HLVDET" values="HLVDCON__HLVDET" />
            <bitfield caption="Internal Reference Voltage Stable Status bit" mask="0x00000200" name="IRVST" values="HLVDCON__IRVST" />
            <bitfield caption="Band Gap Reference Voltages Stable Status bit" mask="0x00000400" name="BGVST" values="HLVDCON__BGVST" />
            <bitfield caption="Voltage Change Direction Select bit" mask="0x00000800" name="VDIR" values="HLVDCON__VDIR" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="HLVD Module Enable bit" mask="0x00008000" name="ON" values="HLVDCON__ON" />
         </register>
      </register-group>
      <value-group caption="High/Low-Voltage Detection Limit Select bits" name="HLVDCON__HLVDL">
         <value caption="External LVDIN pin" name="" value="0xf" />
         <value caption="VDD trip point is between 2.00V and 2.22V" name="" value="0xe" />
         <value caption="VDD trip point is between 2.08V and 2.33V" name="" value="0xd" />
         <value caption="VDD trip point is between 2.15V and 2.44V" name="" value="0xc" />
         <value caption="VDD trip point is between 2.25V and 2.55V" name="" value="0xb" />
         <value caption="VDD trip point is between 2.35V and 2.69V" name="" value="0xa" />
         <value caption="VDD trip point is between 2.45V and 2.80V" name="" value="0x9" />
         <value caption="VDD trip point is between 2.65V and 2.98V" name="" value="0x8" />
         <value caption="VDD trip point is between 2.75V and 3.09V" name="" value="0x7" />
         <value caption="VDD trip point is between 2.95V and 3.30V" name="" value="0x6" />
         <value caption="VDD trip point is between 3.25V and 3.63V" name="" value="0x5" />
         <value caption="Reserved; do not use" name="" value="0x4" />
         <value caption="Reserved; do not use" name="" value="0x3" />
         <value caption="Reserved; do not use" name="" value="0x2" />
         <value caption="Reserved; do not use" name="" value="0x1" />
         <value caption="Reserved; do not use" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low-Voltage Detection Event Status bit" name="HLVDCON__HLVDET">
         <value caption="Indicates HLVD Event interrupt is active" name="" value="0x1" />
         <value caption="Indicates HLVD Event interrupt is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Internal Reference Voltage Stable Status bit" name="HLVDCON__IRVST">
         <value caption="Indicates internal reference voltage references is stable" name="" value="0x1" />
         <value caption="Indicates internal reference voltage reference is not stable" name="" value="0x0" />
      </value-group>
